export const genesis = new Date('2023-04-14').getTime();

export const BS: any[][] = [
  [2080, 31, 32, 31, 32, 31, 30, 30, 30, 29, 29, 30, 30],
  [2081, 31, 32, 31, 32, 31, 30, 30, 30, 29, 30, 30, 30],
  [2082, 30, 32, 31, 32, 31, 30, 30, 30, 29, 30, 30, 30],
  [2083, 31, 31, 32, 31, 31, 30, 30, 30, 29, 30, 30, 30],
  [2084, 31, 31, 32, 31, 31, 30, 30, 30, 29, 30, 30, 30],
  [2085, 31, 32, 31, 32, 30, 31, 30, 30, 29, 30, 30, 30],
  [2086, 30, 32, 31, 32, 31, 30, 30, 30, 29, 30, 30, 30],
  [2087, 31, 31, 32, 31, 31, 31, 30, 30, 29, 30, 30, 30],
  [2088, 30, 31, 32, 32, 30, 31, 30, 30, 29, 30, 30, 30],
  [2089, 30, 32, 31, 32, 31, 30, 30, 30, 29, 30, 30, 30],
  [2090, 30, 32, 31, 32, 31, 30, 30, 30, 29, 30, 30, 30],
  [2091, 31, 31, 32, 31, 31, 31, 30, 30, 29, 30, 30, 30],
  [2092, 30, 31, 32, 32, 31, 30, 30, 30, 29, 30, 30, 30],
  [2093, 30, 32, 31, 32, 31, 30, 30, 30, 29, 30, 30, 30],
  [2094, 31, 31, 32, 31, 31, 30, 30, 30, 29, 30, 30, 30],
  [2095, 31, 31, 32, 31, 31, 31, 30, 29, 30, 30, 30, 30],
  [2096, 30, 31, 32, 32, 31, 30, 30, 29, 30, 29, 30, 30],
  [2097, 31, 32, 31, 32, 31, 30, 30, 30, 29, 30, 30, 30],
  [2098, 31, 31, 32, 31, 31, 31, 29, 30, 29, 30, 29, 31],
  [2099, 31, 32, 31, 32, 31, 30, 30, 30, 29, 29, 30, 31],
];

interface Values {
  short: string[];
  medium?: string[];
  long?: string[];
}

export const numberMapping: string[] = [
  '०',
  '१',
  '२',
  '३',
  '४',
  '५',
  '६',
  '७',
  '८',
  '९',
];

export interface MonthMapping {
  en: Values;
  ne: Values;
}

export interface DaysMapping {
  en: Values;
  ne: Values;
}

export const daysMapping: DaysMapping = {
  en: {
    short: ['Su', 'Mo', 'Tu', 'We', 'Th', 'Fr', 'Sa'],
    medium: ['Sun', 'Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat'],
  },
  ne: {
    short: ['आ', 'सो', 'मं', 'बु', 'बि', 'शु', 'श'],
    medium: ['आइत', 'सोम', 'मंगल्', 'बुध', 'बिही', 'शुक्र', 'शनि'],
  },
};

export const monthsMapping: MonthMapping = {
  en: {
    long: [
      'Baisakh',
      'Jestha',
      'Asadh',
      'Shrawan',
      'Bhadra',
      'Ashwin',
      'Kartik',
      'Mangsir',
      'Poush',
      'Marga',
      'Falgun',
      'Chaitra',
    ],
    medium: [
      'Bai',
      'Jes',
      'Asa',
      'Shr',
      'Bha',
      'Ash',
      'Kar',
      'Man',
      'Pou',
      'Mar',
      'Fal',
      'Cha',
    ],
    short: [
      'Ba',
      'Je',
      'As',
      'Sr',
      'Bh',
      'As',
      'Ka',
      'Ma',
      'Pu',
      'Ma',
      'Fa',
      'Ch',
    ],
  },
  ne: {
    long: [
      'बैशाख',
      'जेष्ठ',
      'आषाढ',
      'श्रावण',
      'भाद्र',
      'आश्विन',
      'कार्तिक',
      'मंसिर',
      'पौष',
      'मार्ग',
      'फाल्गुन',
      'चैत्र',
    ],
    medium: [
      'बैशाख',
      'जेठ',
      'असार',
      'साउन',
      'भदौ',
      'अशोज',
      'कार्तिक',
      'मंसिर',
      'पुष',
      'माघ',
      'फागुन',
      'चैत',
    ],
    short: [
      'बै',
      'जे',
      'अ',
      'श्रा',
      'भा',
      'आ',
      'का',
      'मं',
      'पौ',
      'मा',
      'फा',
      'चै',
    ],
  },
};
